## The map() method 

### For Series, to replace existing values with different values

In [10]:
import pandas as pd
import numpy as np

In [11]:
df = pd.DataFrame(
    {
    "user": [1, 2, 3],
    "age": [24, 54, 17],
    "sex": ["F", "F", "M"],
    "occupation": ["technician", "musician", "student"],
    }
)
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [12]:
# Replace M to male and F to Female using map() function
# Possible values are passed in the dictionary
# Make sure all of possible value pairs in the dictionary

df["sex"] = df["sex"].map({"F": "Female", "M": "Male"})

In [13]:
df # It replaces in the original data

   user  age     sex  occupation
0     1   24  Female  technician
1     2   54  Female    musician
2     3   17    Male     student

## The replace() method
### Applied to both series and dataframe, replace all values or subset of values. It leaves the other values as is.

In [14]:
df2 = pd.DataFrame(
    {
    "user": [1, 2, 3],
    "age": [24, 54, 17],
    "sex": ["F", "F", "M"],
    "occupation": ["technician", "musician", "student"],
    }
)
df2

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [15]:
df2["sex"].replace("F", "1")

0    1
1    1
2    M
Name: sex, dtype: object

In [16]:
df2 # Original dataframe does not change

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

## The apply() method

### Both for series and dataframe. Applying function to either the rows or the columns.

In [17]:
df3 = pd.DataFrame(data=np.arange(9).reshape(3, 3), columns=["a", "b", "c"])
df3

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [18]:
df3.apply(sum, axis=0) # to sum along the columns

a     9
b    12
c    15
dtype: int64

In [19]:
df3.apply(sum, axis=1) # to sum along the rows

0     3
1    12
2    21
dtype: int64

In [21]:
# Finding maximum entry to each row

df3.apply(np.max, axis=1)

0    2
1    5
2    8
dtype: int64

In [22]:
# Finding maximum entry to each column
df3.apply(np.max, axis=0)

a    6
b    7
c    8
dtype: int64

In [23]:
# Find the mean value of each column

df3.apply(np.mean, axis=0)

a    3.0
b    4.0
c    5.0
dtype: float64

In [24]:
# Find the mean value of each row

df3.apply(np.mean, axis=1)

0    1.0
1    4.0
2    7.0
dtype: float64

## The applymap() function
### Apply a function to every element of a DataFrame

In [25]:
def my_func(x):
    if x > 5:
        size = "Large"
    elif x > 3:
        size = "Median"
    else:
        size = "Small"
    return size

In [26]:
df3.applymap(my_func)

       a       b       c
0  Small   Small   Small
1  Small  Median  Median
2  Large   Large   Large

In [27]:
df3 # Original dataframe does not change

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8